jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
//(c)2010 by Texas Instruments Incorporated, All Rights Reserved.

/**
  * @file       /otplatform/msp430f5/usb_cdc_driver/usb_main.c
  * @author     JP Norair
  * @version    V1.0
  * @date       4 Jun 2012
  * @brief      Main driver/MAC for USB  implementation
  * @defgroup   USB CDC Driver
  * @ingroup    USB CDC Driver
  *
  * This module is a derivative work of TI's USB library file, usb.c.  JP has
  * optimized it to compile into less code by streamlining data alignment and 
  * other such tricks.  In addition, functionality supporting composite devices
  * is no longer supported.  The module is especially optimized to be a CDC
  * endpoint with 1 control endpoint, 1 bulk-in, and 1 bulk-out.
  * 
  * The revision history from the original TI codebase is shown below.      <BR>
  * Source: usb.c, File Version 1.02 2010/06/17                             <BR>
  * Author: RSTO
  * <PRE>
  * WHO          WHEN         WHAT                                          
  * ---          ----------   --------------------------------------------- 
  * RSTO         2008/09/03   born                                          
  * RSTO         2008/12/23   enhancements of CDC API                       
  * RSTO         2009/01/12   enhancements for USB serial number            
  * RSTO         2009/05/15   added USB_connectionState()                   
  * RSTO         2009/07/17   added __data16 qualifier for USB buffers      
  * RSTO         2009/08/04   workaround for PLL start up problem           
  * MSP,Biju     2009/10/20   Changes for composite support                 
  * RSTO         2009/10/21   updated USB_InitSerialStringDescriptor()      
  * RSTO         2009/11/05   updated USB_connectionState()                 
  * MSP,Biju     2010/07/15   Updated for MSC
  * </PRE>                           
  *****************************************************************************/

#include "OT_config.h"

#include "msp430f5_lib.h"

#include "usb_cdc_driver/usb_device.h"
#include "usb_cdc_driver/usb_types.h"    //Basic Type declarations
#include "usb_cdc_driver/defMSP430USB.h"
#include "usb_cdc_driver/usb_main.h"      //USB-specific Data Structures
#include "usb_cdc_driver/usb_cdc_backend.h"
#include "usb_cdc_driver/usb_descriptors.h"

#if defined(_CDC_)

//#include "HAL_UCS.h"
//#include "HAL_TLV.h"

//#include <string.h>

/*----------------------------------------------------------------------------+
 | Internal Constant Definition                                               |
 +----------------------------------------------------------------------------*/
#define NO_MORE_DATA    0xFFFF
#define EPBCT_NAK       0x80
#define EPCNF_TOGLE     0x20

#define DIRECTION_IN    0x80
#define DIRECTION_OUT   0x00

/*----------------------------------------------------------------------------+
 | Internal Variables                                                          |
 +----------------------------------------------------------------------------*/

//Set to 1 when USB device has been configured, set to 0 when unconfigured
static ot_u8 bConfigurationNumber;


//interface number
static ot_u8 bInterfaceNumber;


//For endpoint zero transmitter only Holds count of bytes remaining to be
//transmitted by endpoint 0.  A value of 0 means that a 0-length data packet
//A value of 0xFFFF means that transfer is complete
ot_u16 wBytesRemainingOnIEP0;


//For endpoint zero transmitter only Holds count of bytes remaining to be
//received by endpoint 0.  A value of 0 means that a 0-length data packet
//A value of 0xFFFF means that transfer is complete.
ot_u16 wBytesRemainingOnOEP0;


//A buffer pointer to input end point 0 Data sent back to host is copied from
//this pointed memory location
static ot_u8* pbIEP0Buffer;


//A buffer pointer to output end point 0 Data sent from host is copied to
//this pointed memory location
static ot_u8* pbOEP0Buffer;



static ot_u8 bHostAskMoreDataThanAvailable = 0;

ot_u8 abUsbRequestReturnData[USB_RETURN_DATA_LENGTH];
ot_u8 abUsbRequestIncomingData[USB_RETURN_DATA_LENGTH];

__no_init ot_u8 abramSerialStringDescriptor[34];

ot_u8 bStatusAction;
ot_u8 bFunctionSuspended = FALSE;    //TRUE if function is suspended
ot_u8 bEnumerationStatus = 0;        //is 0 if not enumerated

static ot_u8 bRemoteWakeup;

//ot_u16 wUsbEventMask;                 //used by USB_getEnabledEvents() and USB_setEnabledEvents()



/*----------------------------------------------------------------------------+
 | Global Variables                                                            |
 +----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------+
 | Hardware Related Structure Definition                                       |
 +----------------------------------------------------------------------------*/

#if defined(__IAR_SYSTEMS_ICC__)

#pragma location = 0x2380
__no_init tDEVICE_REQUEST __data16 tSetupPacket;

#pragma location = 0x0920
__no_init tEDB0 __data16 tEndPoint0DescriptorBlock;

#pragma location = 0x23C8
__no_init tEDB __data16 tInputEndPointDescriptorBlock[7];

#pragma location = 0x2388
__no_init tEDB __data16 tOutputEndPointDescriptorBlock[7];

#pragma location = 0x2378
__no_init ot_u8 __data16 abIEP0Buffer[EP0_MAX_PACKET_SIZE];

#pragma location = 0x2370
__no_init ot_u8 __data16 abOEP0Buffer[EP0_MAX_PACKET_SIZE];

#pragma location = OEP1_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp1[EP_MAX_PACKET_SIZE];

#pragma location = OEP1_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp1[EP_MAX_PACKET_SIZE];

#pragma location = IEP1_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp81[EP_MAX_PACKET_SIZE];

#pragma location = IEP1_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp81[EP_MAX_PACKET_SIZE];

#pragma location = OEP2_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp2[EP_MAX_PACKET_SIZE];

#pragma location = OEP2_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp2[EP_MAX_PACKET_SIZE];

