jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
#pragma location = IEP2_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp82[EP_MAX_PACKET_SIZE];

#pragma location = IEP2_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp82[EP_MAX_PACKET_SIZE];

#pragma location = OEP3_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp3[EP_MAX_PACKET_SIZE];

#pragma location = OEP3_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp3[EP_MAX_PACKET_SIZE];

#pragma location = IEP3_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp83[EP_MAX_PACKET_SIZE];

#pragma location = IEP3_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp83[EP_MAX_PACKET_SIZE];

#pragma location = OEP4_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp4[EP_MAX_PACKET_SIZE];

#pragma location = OEP4_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp4[EP_MAX_PACKET_SIZE];

#pragma location = IEP4_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp84[EP_MAX_PACKET_SIZE];

#pragma location = IEP4_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp84[EP_MAX_PACKET_SIZE];

#pragma location = OEP5_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp5[EP_MAX_PACKET_SIZE];

#pragma location = OEP5_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp5[EP_MAX_PACKET_SIZE];

#pragma location = IEP5_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp85[EP_MAX_PACKET_SIZE];

#pragma location = IEP5_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp85[EP_MAX_PACKET_SIZE];

#pragma location = OEP6_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp6[EP_MAX_PACKET_SIZE];

#pragma location = OEP6_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp6[EP_MAX_PACKET_SIZE];

#pragma location = IEP6_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp86[EP_MAX_PACKET_SIZE];

#pragma location = IEP6_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp86[EP_MAX_PACKET_SIZE];

#pragma location = OEP7_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp7[EP_MAX_PACKET_SIZE];

#pragma location = OEP7_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp7[EP_MAX_PACKET_SIZE];

#pragma location = IEP7_X_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbXBufferAddressEp87[EP_MAX_PACKET_SIZE];

#pragma location = IEP7_Y_BUFFER_ADDRESS
__no_init ot_u8 __data16 pbYBufferAddressEp87[EP_MAX_PACKET_SIZE];



#elif 0 //defined(__TI_COMPILER_VERSION__)
extern __no_init tDEVICE_REQUEST tSetupPacket;
extern __no_init tEDB0 tEndPoint0DescriptorBlock;
extern __no_init tEDB tInputEndPointDescriptorBlock[7];
extern __no_init tEDB tOutputEndPointDescriptorBlock[7];
extern __no_init ot_u8 abIEP0Buffer[EP0_MAX_PACKET_SIZE];
extern __no_init ot_u8 abOEP0Buffer[EP0_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp1[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp1[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp81[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp81[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp2[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp2[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp82[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp82[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp3[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp3[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp83[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp83[EP_MAX_PACKET_SIZE];

extern __no_init ot_u8 pbXBufferAddressEp4[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp4[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp84[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp84[EP_MAX_PACKET_SIZE];

extern __no_init ot_u8 pbXBufferAddressEp5[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp5[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbXBufferAddressEp85[EP_MAX_PACKET_SIZE];
extern __no_init ot_u8 pbYBufferAddressEp85[EP_MAX_PACKET_SIZE];


#else
//defined in usb.h




#endif


const tEDB* dbselect[] = { tInputEndPointDescriptorBlock,
                           tOutputEndPointDescriptorBlock
                          };
                          
                          

void CdcResetData ();

void USB_InitSerialStringDescriptor (void);
//void USB_initMemcpy (void);

//----------------------------------------------------------------------------
ot_u8 USB_init (void) {
    ot_u16 bGIE  = __get_SR_register() & GIE;  	//save interrupt status

    //atomic operation - disable interrupts
    __disable_interrupt();

    //configuration of USB module
    USBKEYPID   = 0x9628;
    /* To fix USB9 enumeration issue seen by Matrox*/
    USBPWRCTL	= 0;
    USBPHYCTL   = PUSEL;				//use DP + DM as USB pins (not needed with external PHY on P9)
    USBPWRCTL   = VUSBEN + SLDOAON;		//enable primary and secondary LDO (3.3 and 1.8V)
    platform_swdelay_ms(5);				//wait some time for LDOs (5ms delay)
    USBPWRCTL   = VUSBEN + SLDOAON + VBONIE; 	//enable interrupt VBUSon
    USBKEYPID   = 0x9600;                       //access to configuration registers disabled

    //reset events mask
    //wUsbEventMask = 0;

    //init Serial Number
#if (USB_STR_INDEX_SERNUM != 0)
    USB_InitSerialStringDescriptor();
#endif

    //USB_initMemcpy();				//using platform_memcpy instead

    __bis_SR_register(bGIE);                                                    //restore interrupt status
    return (kUSB_succeed);
}

//----------------------------------------------------------------------------
//This function will be compiled only if
#if (USB_STR_INDEX_SERNUM != 0)
void USB_InitSerialStringDescriptor (void)
{
    ot_u8* pbSerNum;
    ot_u8 bBytes;
    ot_u8 j;

    //pbSerNum = 0;
    *((ot_u16*)&abramSerialStringDescriptor[0]) = (4 | (DESC_TYPE_STRING<<8));
    *((ot_u16*)&abramSerialStringDescriptor[2]) = 0;

    //TLV access Function Call
    TLV_Get_Info(TLV_DIERECORD, 0, (u8*)&bBytes, (u16**)&pbSerNum); //The die record used for serial number

    if (bBytes != 0) {
    	if (bBytes > 8)
    		bBytes = 8;

        for (j=1; bBytes!=0; ++pbSerNum, --bBytes) {
        	ot_u8 hex1  = *pbSerNum & 0x0F;
        	ot_u8 hex0	= (*pbSerNum >> 4) & 0x0F;
            hex0	   += (hex0 >= 10) ? ('a'-10) : '0';
            hex1	   += (hex1 >= 10) ? ('a'-10) : '0';

            abramSerialStringDescriptor[++j] = hex0;
            abramSerialStringDescriptor[++j] = 0x00;		//unicode extension
            abramSerialStringDescriptor[++j] = hex1;
            abramSerialStringDescriptor[++j] = 0x00;		//unicode extension
        }
        abramSerialStringDescriptor[0] = ++j;      	//calculate the length
    }
}

#endif

//----------------------------------------------------------------------------

