jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
ot_u8 USB_enable () {
    //volatile unsigned int i;
    //volatile unsigned int j = 0;
    ot_int j = 0;
	ot_u16 pll_unsettled;

    //check USB Bandgap and VBUS valid
    if (!(USBPWRCTL & USBBGVBV)){
        return (kUSB_generalError);
    }

    //exit if PLL is already enabled
    if ((USBCNF & USB_EN) && (USBPLLCTL & UPLLEN)){
        return (kUSB_succeed);
    }

    ///@todo Make sure that this function only gets called at power-on (seems like the case).
    ///      At power-on, OpenTag already configures XT2
#	ifdef BOARD_RF430USB_5509
    //XT2_Start(XT2DRIVE_3);
    
#	endif
    USBKEYPID	= 0x9628;
    USBPLLDIVB 	= USB_XT_FREQ;					//Settings desired frequency

#	if (USB_PLL_XT == 2)
        USBPLLCTL = UPCS0 + UPFDEN + UPLLEN;  	//Select XT2 as Ref, PLL for USB, Discrim. on, enable PLL
#	else
        USBPLLCTL = UPFDEN + UPLLEN;			//Select XT1 as Ref, PLL for USB, Discrim. on, enable PLL
#	endif

    //Wait some time till PLL is settled
    // - Clear PLL IR and wait some time for settling
    // - Success if PLL IR stays 0 (no error flags go high)
    // - Try 10 times, and give-up if PLL IR will not settle after 10 tries
    do {
        USBPLLIR    = 0x0000;
#		ifdef __MSP430F6638
        	platform_swdelay_us(1000);
        	//for (i = 0; i < USB_MCLK_FREQ / 1000 * 1 / 10; i++);  //1ms
#		else
        	platform_swdelay_us(500);
        	//for (i = 0; i < USB_MCLK_FREQ / 1000 * 1 / 2 / 10; i++);	//0.5ms
#		endif

        pll_unsettled = (USBPLLIR != 0);
    }
    while (pll_unsettled && (++j <= 10));

    USBCNF     |= !pll_unsettled;	//Enable USB if PLL settled (USB_EN = 0x0001)
    USBKEYPID   = 0x9600;

    return pll_unsettled;	//kUSB_succeed = 0, kUSB_generalError = 1
}

/*
 * Disables the USB module and PLL.
 */
ot_u8 USB_disable (void) {
    USBKEYPID			= 0x9628;
    USBCNF    			= 0;  			//disable USB module
    USBPLLCTL  		   &= ~UPLLEN;      //disable PLL
    USBKEYPID 			= 0x9600;
    bEnumerationStatus 	= 0x00;         //device is not enumerated
    bFunctionSuspended 	= FALSE;        //device is not suspended
    return (kUSB_succeed);
}

/*
 * Enables/disables various USB events.
 */
//ot_u8 USB_setEnabledEvents (ot_u16 events) {
//    wUsbEventMask = events;
//    return (kUSB_succeed);
//}

/*
 * Returns which events are enabled and which are disabled.
 */
//ot_u16 USB_getEnabledEvents () {
//    return (wUsbEventMask);
//}

/*
 * Reset USB-SIE and global variables.
 */
ot_u8 USB_reset () {
	ot_u8 edbIndex;

    USBKEYPID = 0x9628;

    //reset should be on the bus after this!
    bEnumerationStatus 		= 0x00;             //Device not enumerated yet
    bFunctionSuspended 		= FALSE;            //Device is not in suspend mode
    bRemoteWakeup 			= DISABLE;
    bConfigurationNumber	= 0x00;        		//device unconfigured
    bInterfaceNumber    	= 0x00;

    //FRSTE handling:
    //Clear FRSTE in the RESRIFG interrupt service routine before re-configuring USB control registers.
    //Set FRSTE at the beginning of SUSRIFG, SETUP, IEPIFG.EP0 and OEPIFG.EP0 interrupt service routines.
    USBCTL 					= 0;        //Function Reset Connection disable (FRSTE)

    wBytesRemainingOnIEP0   = NO_MORE_DATA;
    wBytesRemainingOnOEP0   = NO_MORE_DATA;
    bStatusAction           = STATUS_ACTION_NOTHING;

    //The address reset normally will be done automatically during bus function reset
    USBFUNADR   			= 0x00;     //Address 0 is the value for "unconfigured device"


    // Set settings for EP0
    //NAK both 0 endpoints and enable endpoint 0 interrupt
    tEndPoint0DescriptorBlock.bIEPBCNT = EPBCNT_NAK;
    tEndPoint0DescriptorBlock.bOEPBCNT = EPBCNT_NAK;
    tEndPoint0DescriptorBlock.bIEPCNFG = EPCNF_USBIE | EPCNF_UBME | EPCNF_STALL;    //8 byte data packet
    tEndPoint0DescriptorBlock.bOEPCNFG = EPCNF_USBIE | EPCNF_UBME | EPCNF_STALL;    //8 byte data packet

    USBOEPIE = USB_OUTEP_INT_EN;
    USBIEPIE = USB_INEP_INT_EN;

    edbIndex = stUsbHandle[0].edb_Index;

    // Set settings for IEPx
    tInputEndPointDescriptorBlock[edbIndex].bEPCNF   = EPCNF_USBIE | EPCNF_UBME | EPCNF_DBUF;   //double buffering

    tInputEndPointDescriptorBlock[edbIndex].bEPBBAX  =
        (ot_u8)(((stUsbHandle[0].iep_X_Buffer - START_OF_USB_BUFFER) >> 3) & 0x00ff);

    tInputEndPointDescriptorBlock[edbIndex].bEPBBAY  =
        (ot_u8)(((stUsbHandle[0].iep_Y_Buffer - START_OF_USB_BUFFER) >> 3) & 0x00ff);

    tInputEndPointDescriptorBlock[edbIndex].bEPBCTX  = EPBCNT_NAK;
    tInputEndPointDescriptorBlock[edbIndex].bEPBCTY  = EPBCNT_NAK;
    tInputEndPointDescriptorBlock[edbIndex].bEPSIZXY = MAX_PACKET_SIZE;

    // Set settings for OEPx
    //double buffering
    tOutputEndPointDescriptorBlock[edbIndex].bEPCNF = EPCNF_USBIE | EPCNF_UBME | EPCNF_DBUF ;
        
    tOutputEndPointDescriptorBlock[edbIndex].bEPBBAX  =
        (ot_u8)(((stUsbHandle[0].oep_X_Buffer - START_OF_USB_BUFFER) >> 3) & 0x00ff);

    tOutputEndPointDescriptorBlock[edbIndex].bEPBBAY  =
        (ot_u8)(((stUsbHandle[0].oep_Y_Buffer - START_OF_USB_BUFFER) >> 3) & 0x00ff);

    tOutputEndPointDescriptorBlock[edbIndex].bEPBCTX  = 0x00;
    tOutputEndPointDescriptorBlock[edbIndex].bEPBCTY  = 0x00;
    tOutputEndPointDescriptorBlock[edbIndex].bEPSIZXY = MAX_PACKET_SIZE;

    // Additional interrupt end point for CDC
    if (stUsbHandle[0].dev_Class == CDC_CLASS){
        //The decriptor tool always generates the managemnet endpoint before the data endpoint
        tInputEndPointDescriptorBlock[edbIndex-1].bEPCNF	= EPCNF_USBIE | EPCNF_UBME | EPCNF_DBUF;
        tInputEndPointDescriptorBlock[edbIndex-1].bEPBBAX   =
            (ot_u8)(((stUsbHandle[0].intepEP_X_Buffer - START_OF_USB_BUFFER) >> 3) & 0x00ff);

        tInputEndPointDescriptorBlock[edbIndex-1].bEPBBAY   =
            (ot_u8)(((stUsbHandle[0].intepEP_Y_Buffer - START_OF_USB_BUFFER) >> 3) & 0x00ff);

        tInputEndPointDescriptorBlock[edbIndex-1].bEPBCTX   = EPBCNT_NAK;
        tInputEndPointDescriptorBlock[edbIndex-1].bEPBCTY   = EPBCNT_NAK;
        tInputEndPointDescriptorBlock[edbIndex-1].bEPSIZXY  = MAX_PACKET_SIZE;
    }

    CdcResetData();   //reset CDC specific data structures

    USBCTL		= FEN;    						//enable function
    USBIFG 		= 0;        					//make sure no interrupts are pending
    USBIE 		= SETUPIE | RSTRIE | SUSRIE;    //enable USB specific interrupts (setup, reset, suspend)
    USBKEYPID 	= 0x9600;

    return (kUSB_succeed);
}

