jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
/*
 * Instruct USB module to make itself available to the PC for connection, by pulling PUR high.
 */
ot_u8 USB_connect () {
    USBKEYPID	= 0x9628;
    USBCNF 	   |= PUR_EN;   //Generate rising edge on DP -> the host, which
                            //enumerates our device as full speed device.
    USBPWRCTL  |= VBOFFIE;  //Enable interrupt VUSBoff
    USBKEYPID   = 0x9600;

    return (kUSB_succeed);
}

/*
 * Force a disconnect from the PC by pulling PUR low.
 */
ot_u8 USB_disconnect () {
    USBKEYPID	        = 0x9628;
    USBCNF             &= ~PUR_EN;	//disconnect pull up resistor - logical disconnect from HOST
    USBPWRCTL          &= ~VBOFFIE; //disable interrupt VUSBoff
    USBKEYPID           = 0x9600;
    bEnumerationStatus	= 0;    	//not enumerated
    bFunctionSuspended 	= FALSE;    //device is not suspended

    return (kUSB_succeed);
}




/*
 * Force a remote wakeup of the USB host.
 */
ot_u8 USB_forceRemoteWakeup () {
    if (bFunctionSuspended == FALSE) {   //device is not suspended
        return (kUSB_NotSuspended);
    }
    if (bRemoteWakeup == ENABLE) {
        //volatile unsigned int i;
        USBCTL |= RWUP;                 //USB - Device Remote Wakeup Request - this bit is self-cleaned
        return (kUSB_succeed);
    }
    return (kUSB_generalError);
}



/*
 * Returns the status of the USB connection.
 */
ot_u8 USB_connectionInfo () {
    ot_u8 retVal = 0;

    if (USBPWRCTL & USBBGVBV)			retVal |= kUSB_vbusPresent;
    if (USBCNF & PUR_EN)				retVal |= kUSB_purHigh;
    if (bEnumerationStatus != 0)		retVal |= kUSB_Enumerated;
    if (bFunctionSuspended != FALSE)	retVal |= kUSB_suspended;
    else 								retVal |= kUSB_NotSuspended;

    return (retVal);
}



/*
 * Returns the state of the USB connection.
 */
ot_u8 USB_connectionState () {

	// JP's version below: compiles smaller, runs faster
	static const ot_u8 retval[16] = {
		ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED,
		ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED, ST_USB_DISCONNECTED,
		ST_USB_CONNECTED_NO_ENUM, ST_ENUM_IN_PROGRESS,
		ST_USB_CONNECTED_NO_ENUM, ST_ENUM_ACTIVE,
		ST_USB_CONNECTED_NO_ENUM, ST_ENUM_IN_PROGRESS,
		ST_NOENUM_SUSPENDED, ST_ENUM_SUSPENDED
	};

	// 8 + 4 + 2 + 1
	ot_u8 code = (USBPWRCTL & USBBGVBV) + \
				((ot_u8)bFunctionSuspended << 2) + \
				(USBCNF & PUR_EN) + \
				(bEnumerationStatus);

	return retval[code];

	/*
    //If no VBUS present
    if (!(USBPWRCTL & USBBGVBV)){
        return (ST_USB_DISCONNECTED);
    }

    //If VBUS present, but PUR is low
    if ((USBPWRCTL & USBBGVBV) && (!(USBCNF & PUR_EN))){
        return (ST_USB_CONNECTED_NO_ENUM);
    }

    //If VBUS present, PUR is high, and enumeration is complete, and not suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (bEnumerationStatus == ENUMERATION_COMPLETE)
        && (!(bFunctionSuspended == TRUE))){
        return (ST_ENUM_ACTIVE);
    }

    //If VBUS present, PUR is high, and enumeration is NOT complete, and  suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (!(bEnumerationStatus == ENUMERATION_COMPLETE))
        && (bFunctionSuspended == TRUE)){
        return (ST_NOENUM_SUSPENDED);
    }

    //If VBUS present, PUR is high, and enumeration is complete, and  suspended
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (bEnumerationStatus == ENUMERATION_COMPLETE)
        && (bFunctionSuspended == TRUE)){
        return (ST_ENUM_SUSPENDED);
    }

    //If VBUS present, PUR is high, but no enumeration yet
    if ((USBPWRCTL & USBBGVBV) && (USBCNF & PUR_EN)
        && (!(bEnumerationStatus == ENUMERATION_COMPLETE))){
        return (ST_ENUM_IN_PROGRESS);
    }

    return (ST_ERROR);
    */
}




ot_u8 USB_suspend (void) {
    bFunctionSuspended	= TRUE;
    USBKEYPID		    = 0x9628;                 //set KEY and PID to 0x9628 -> access to configuration registers enabled
    USBCTL 			   |= FRSTE;                    //Function Reset Connection Enable
    USBIFG 			   &= ~SUSRIFG;                 //clear interrupt flag
    USBPLLCTL 		   &= ~UPLLEN;

#   if (USB_DISABLE_XT_SUSPEND)
#       if (USB_PLL_XT == 2)
            UCSCTL6 |= XT2OFF;        //disable XT2
#       else
            UCSCTL6 |= XT1OFF;
#       endif
#	endif

    //Disable USB specific interrupts (setup, suspend, reset), enable resume.
    //If the reset occurred during device in suspend, the resume-interrupt will
    //come, after reset interrupt
    USBIE 		= RESRIE;
    USBKEYPID	= 0x9600;

    return (kUSB_succeed);
}




ot_u8 USB_resume (void) {
    USB_enable();                       	//enable PLL

    USBIFG &= ~(RESRIFG | SUSRIFG);     	//clear interrupt flags
    USBIE	= SETUPIE | RSTRIE | SUSRIE;  	//enable USB specific interrupts (setup, reset, suspend)

    bFunctionSuspended = FALSE;
    return (kUSB_succeed);
}




void usbStallEndpoint0 (void) {
    tEndPoint0DescriptorBlock.bIEPCNFG |= EPCNF_STALL;
    tEndPoint0DescriptorBlock.bOEPCNFG |= EPCNF_STALL;
}




void usbClearOEP0ByteCount (void) {
    tEndPoint0DescriptorBlock.bOEPBCNT = 0x00;
}




void usbStallOEP0 (void) {
    //in standard USB request, there is not control write request with data stage
    //control write, stall output endpoint 0
    //wLength should be 0 in all cases
    tEndPoint0DescriptorBlock.bOEPCNFG |= EPCNF_STALL;
}




void usbSendNextPacketOnIEP0 (void) {
    ot_u8 bPacketSize, bIndex;

    //First check if there are bytes remaining to be transferred
    if (wBytesRemainingOnIEP0 != NO_MORE_DATA){
        if (wBytesRemainingOnIEP0 > EP0_PACKET_SIZE){
            //More bytes are remaining than will fit in one packet
            //there will be More IN Stage
            bPacketSize 			= EP0_PACKET_SIZE;
            wBytesRemainingOnIEP0  -= EP0_PACKET_SIZE;
            bStatusAction 			= STATUS_ACTION_DATA_IN;
        }
        else if (wBytesRemainingOnIEP0 < EP0_PACKET_SIZE){
            //The remaining data will fit in one packet.
            //This case will properly handle wBytesRemainingOnIEP0 == 0
            bPacketSize 			= (ot_u8)wBytesRemainingOnIEP0;
            wBytesRemainingOnIEP0 	= NO_MORE_DATA;   //No more data need to be Txed
            bStatusAction 			= STATUS_ACTION_NOTHING;
        }
        else {
            bPacketSize = EP0_PACKET_SIZE;
            if (bHostAskMoreDataThanAvailable == TRUE) {
                wBytesRemainingOnIEP0 	= 0;
                bStatusAction 			= STATUS_ACTION_DATA_IN;
            }
            else {
                wBytesRemainingOnIEP0 	= NO_MORE_DATA;
                bStatusAction 			= STATUS_ACTION_NOTHING;
            }
        }

