jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
        for (bIndex = 0; bIndex < bPacketSize; bIndex++) {
            abIEP0Buffer[bIndex] = *pbIEP0Buffer;
            pbIEP0Buffer++;
        }
        tEndPoint0DescriptorBlock.bIEPBCNT = bPacketSize;
    }
    else {
        bStatusAction = STATUS_ACTION_NOTHING;
    }
}




void usbSendDataPacketOnEP0 (ot_u8* pbBuffer) {
    ot_u16 wTemp;

    pbIEP0Buffer	= pbBuffer;
    wTemp 			= tSetupPacket.wLength;

    //Limit transfer size to wLength if needed
    //this prevent USB device sending 'more than require' data back to host
    bHostAskMoreDataThanAvailable = (wBytesRemainingOnIEP0 < wTemp);

    if (bHostAskMoreDataThanAvailable == FALSE){
        wBytesRemainingOnIEP0 = wTemp;
    }

    usbSendNextPacketOnIEP0();
}



void usbReceiveNextPacketOnOEP0 (void) {
    ot_u8 bIndex,bByte;

    bByte = tEndPoint0DescriptorBlock.bOEPBCNT & EPBCNT_BYTECNT_MASK;

    if (wBytesRemainingOnOEP0 >= (ot_u16)bByte){
        for (bIndex = 0; bIndex < bByte; bIndex++) {
            *pbOEP0Buffer = abOEP0Buffer[bIndex];
            pbOEP0Buffer++;
        }
        wBytesRemainingOnOEP0 -= (ot_u16)bByte;

        //clear the NAK bit for next packet
        if (wBytesRemainingOnOEP0 > 0){
            usbClearOEP0ByteCount();
            bStatusAction = STATUS_ACTION_DATA_OUT;
            return;
        }
    }

    usbStallOEP0();
    bStatusAction = STATUS_ACTION_NOTHING;
}





void usbReceiveDataPacketOnEP0 (ot_u8* pbBuffer) {
    pbOEP0Buffer 			= pbBuffer;
    wBytesRemainingOnOEP0 	= tSetupPacket.wLength;
    bStatusAction 			= STATUS_ACTION_DATA_OUT;

    usbClearOEP0ByteCount();
}




void usbSendZeroLengthPacketOnIEP0 (void) {
    tEndPoint0DescriptorBlock.bIEPBCNT 	= 0x00;
    wBytesRemainingOnIEP0 				= NO_MORE_DATA;
    bStatusAction 						= STATUS_ACTION_NOTHING;
}




ot_u8 usbClearEndpointFeature (void) {
    ot_u8 bEndpointNumber;

    //EP is from EP1 to EP7 while C language start from 0
    bEndpointNumber = (tSetupPacket.wIndex & EP_DESC_ADDR_EP_NUM);
    if (bEndpointNumber <= MAX_ENDPOINT_NUMBER) {
        if (bEndpointNumber != 0x00) {
        	tEDB* dblock;
            bEndpointNumber--;
            dblock = (tEDB*)dbselect[(tSetupPacket.wIndex&EP_DESC_ADDR_DIR_IN)!=EP_DESC_ADDR_DIR_IN];
            dblock[bEndpointNumber].bEPCNF &= ~(EPCNF_STALL | EPCNF_TOGGLE );
        }
        usbSendZeroLengthPacketOnIEP0();
    }

    return (FALSE);
}



ot_u8 sub_usbget(ot_u8 remaining_bytes, ot_u8* send_data) {
    usbClearOEP0ByteCount();                                //for status stage
    wBytesRemainingOnIEP0 = remaining_bytes;
    usbSendDataPacketOnEP0(send_data);
    return FALSE;
}


ot_u8 usbGetConfiguration (void) {
    return sub_usbget(1, (ot_u8*)&bConfigurationNumber);
}

ot_u8 usbGetDeviceDescriptor (void) {
    return sub_usbget(SIZEOF_DEVICE_DESCRIPTOR, (ot_u8*)&abromDeviceDescriptor);
}

ot_u8 usbGetConfigurationDescriptor (void) {
    return sub_usbget(sizeof(abromConfigurationDescriptorGroup), (ot_u8*)&abromConfigurationDescriptorGroup);
}




ot_u8 usbGetStringDescriptor (void) {
    ot_u16 bIndex   = 0;
    ot_u8 bVal      = (ot_u8)tSetupPacket.wValue;

#if (USB_STR_INDEX_SERNUM != 0)
    if (bVal != 0x03){
        while (bVal-- >  0x00)
        	bIndex += abromStringDescriptor[bIndex];
    }
#endif
    return sub_usbget(abromStringDescriptor[bIndex], (ot_u8*)&abromStringDescriptor[bIndex]);
}




ot_u8 usbGetInterface (void) {
    //not fully supported, return one byte, zero
    abUsbRequestReturnData[0] = 0x00;   //changed to report alternative setting byte
    abUsbRequestReturnData[1] = bInterfaceNumber;
    
    return sub_usbget(2, (ot_u8*)&abUsbRequestReturnData[0]);
}




ot_u8 usbGetDeviceStatus (void) {
    if ((abromConfigurationDescriptorGroup.abromConfigurationDescriptorGenric.mattributes &
         CFG_DESC_ATTR_SELF_POWERED) == CFG_DESC_ATTR_SELF_POWERED) {
        abUsbRequestReturnData[0] = DEVICE_STATUS_SELF_POWER;
    }

    if (bRemoteWakeup == ENABLE){
        abUsbRequestReturnData[0] |= DEVICE_STATUS_REMOTE_WAKEUP;
    }

    //Return self power status and remote wakeup status
    return sub_usbget(2, (ot_u8*)&abUsbRequestReturnData[0]);
}




ot_u8 usbGetInterfaceStatus(void) {
    //check bIndexL for index number (not supported)
    abUsbRequestReturnData[0] = 0x00;   //changed to support multiple interfaces
    abUsbRequestReturnData[1] = bInterfaceNumber;
    
    return sub_usbget(2, (ot_u8*)&abUsbRequestReturnData[0]);
}




ot_u8 usbGetEndpointStatus (void) {
    ot_u8 bEndpointNumber;

    //Endpoint number is bIndexL
    bEndpointNumber = tSetupPacket.wIndex & EP_DESC_ADDR_EP_NUM;
    if (bEndpointNumber == 0x00) {
        ot_u8* db0CNFG;
        db0CNFG                     = (tSetupPacket.wIndex&EP_DESC_ADDR_DIR_IN) ? \
                                        ((ot_u8*)&tEndPoint0DescriptorBlock)+1 : \
                                        ((ot_u8*)&tEndPoint0DescriptorBlock)+3;
        abUsbRequestReturnData[0]   = *db0CNFG & EPCNF_STALL;
    }
    
    //no response if endpoint is not supported.
    else if (bEndpointNumber <= MAX_ENDPOINT_NUMBER) {
        //EP is from EP1 to EP7 while C language start from 0
        //Firmware should NOT response if specified endpoint is not supported. (charpter 8)
    	tEDB* dblock;
    	bEndpointNumber--;
    	dblock 						= (tEDB*)dbselect[(tSetupPacket.wIndex&EP_DESC_ADDR_DIR_IN)==0];
    	abUsbRequestReturnData[0] 	= dblock[bEndpointNumber].bEPCNF & EPCNF_STALL;
    }
    
    abUsbRequestReturnData[0] >>= 3; //STALL is on bit 3
    return sub_usbget(2, (ot_u8*)&abUsbRequestReturnData[0]);
}



ot_u8 usbSetAddress (void) {
    usbStallOEP0();     //control write without data stage

    //bValueL contains device address
    if (tSetupPacket.wValue < 128){
        //hardware will update the address after status stage
        //therefore, firmware can set the address now.
        USBFUNADR = tSetupPacket.wValue;
        usbSendZeroLengthPacketOnIEP0();
    }
    else {
        usbStallEndpoint0();
    }

    return (FALSE);
}




