jpnorair/OpenTag/otplatform/msp430f5/usb_cdc_driver/usb_main.c
ot_u8 usbSetConfiguration (void) {
    usbStallOEP0();        //control write without data stage

    //configuration number is in bValueL
    //change the code if more than one configuration is supported
    bConfigurationNumber = tSetupPacket.wValue;
    bEnumerationStatus = bConfigurationNumber;			//added by JP

    usbSendZeroLengthPacketOnIEP0();

    // Commented-out by JP
    //if (bConfigurationNumber == 1){
    //    bEnumerationStatus = ENUMERATION_COMPLETE;                  //set device as enumerated
    //}
    //else {
    //    bEnumerationStatus = 0;                                     //device is not configured == config # is zero
    //}

    return (FALSE);
}



//Added by JP
ot_u8 sub_EvalDeviceFeature(ot_u8 set_wakeup) {
	//bValueL contains feature selector
	if (tSetupPacket.wValue == FEATURE_REMOTE_WAKEUP){
	    bRemoteWakeup = set_wakeup;
	    usbSendZeroLengthPacketOnIEP0();
	}
    else {
	    usbStallEndpoint0();
	}
	return (FALSE);
}


ot_u8 usbClearDeviceFeature (void) {
	return sub_EvalDeviceFeature(DISABLE);
}


ot_u8 usbSetDeviceFeature (void) {
	return sub_EvalDeviceFeature(ENABLE);
}



ot_u8 usbSetEndpointFeature (void) {
    ot_u8 bEndpointNumber;

    //wValue contains feature selector
    //bIndexL contains endpoint number
    //Endpoint number is in low byte of wIndex
    if (tSetupPacket.wValue == FEATURE_ENDPOINT_STALL){
        bEndpointNumber = tSetupPacket.wIndex & EP_DESC_ADDR_EP_NUM;
        if (bEndpointNumber <= MAX_ENDPOINT_NUMBER) {
            if (bEndpointNumber != 0) {
            	tEDB* dblock;
                bEndpointNumber--;
                dblock = (tEDB*)dbselect[(tSetupPacket.wIndex&EP_DESC_ADDR_DIR_IN)==0];
                dblock[bEndpointNumber].bEPCNF |= EPCNF_STALL;
            }
            usbSendZeroLengthPacketOnIEP0();    //do nothing for endpoint 0
        }
    }
    else {
        usbStallEndpoint0();
    }

    return (FALSE);
}




ot_u8 usbSetInterface (void) {
    //bValueL contains alternative setting
    //bIndexL contains interface number
    //change code if more than one interface is supported
    usbStallOEP0();                         //control write without data stage
    bInterfaceNumber = tSetupPacket.wIndex;

    usbSendZeroLengthPacketOnIEP0();

    return (FALSE);
}




ot_u8 usbInvalidRequest (void) {
    //check if setup overwrite is set
    //if set, do nothing since we might decode it wrong
    //setup packet buffer could be modified by hardware if another setup packet
    //was sent while we are deocding setup packet
    if ((USBIFG & STPOWIFG) == 0x00){
        usbStallEndpoint0();
    }

    return (FALSE);
}



typedef ot_u8 (*tpF)(void);

ot_u8 usbDecodeAndProcessUsbRequest (void) {
    ot_u8 bMask,bResult,bTemp;
    const ot_u8* pbUsbRequestList;
    ot_u8 bWakeUp = FALSE;
    ptDEVICE_REQUEST ptSetupPacket = &tSetupPacket;
    ot_u8 bRequestType,bRequest;
    tpF lAddrOfFunction;

    //point to beginning of the matrix
    pbUsbRequestList = (ot_u8*)&tUsbRequestList[0];

    while (1) {
        bRequestType = *pbUsbRequestList++;
        bRequest     = *pbUsbRequestList++;

        if (((bRequestType == 0xff) && (bRequest == 0xff)) ||
            (tSetupPacket.bmRequestType == (USB_REQ_TYPE_INPUT | USB_REQ_TYPE_VENDOR | USB_REQ_TYPE_DEVICE)) ||
            (tSetupPacket.bmRequestType == (USB_REQ_TYPE_OUTPUT | USB_REQ_TYPE_VENDOR | USB_REQ_TYPE_DEVICE)))
        {
            pbUsbRequestList -= 2;
            break;
        }

        if ((bRequestType == tSetupPacket.bmRequestType) && (bRequest == tSetupPacket.bRequest)) {
            //compare the first two
            bResult = 0xc0;
            bMask   = 0x20;
            //first two bytes matched, compare the rest
            for (bTemp = 2; bTemp < 8; bTemp++) {
                if (*((ot_u8*)ptSetupPacket + bTemp) == *pbUsbRequestList) {
                    bResult |= bMask;
                }
                pbUsbRequestList++;
                bMask = bMask >> 1;
            }
            //now we have the result
            if ((*pbUsbRequestList & bResult) == *pbUsbRequestList){
                pbUsbRequestList -= 8;
                break;
            }
            else {
                pbUsbRequestList += (sizeof(tDEVICE_REQUEST_COMPARE) - 8);
            }
        }
        else {
            pbUsbRequestList += (sizeof(tDEVICE_REQUEST_COMPARE) - 2);
        }
    }

    //if another setup packet comes before we have the chance to process current
    //setup request, we return here without processing the request
    //this check is not necessary but still kept here to reduce response(or simulation) time

    if ((USBIFG & STPOWIFG) != 0x00){
        return (bWakeUp);
    }

    //now we found the match and jump to the function accordingly.
    lAddrOfFunction = ((tDEVICE_REQUEST_COMPARE*)pbUsbRequestList)->pUsbFunction;

    //call function
    bWakeUp = (*lAddrOfFunction)();

    //perform enumeration complete event:
    //when SetAddress was called and USBADDR is not zero
    if ((lAddrOfFunction == &usbSetAddress) && (USBFUNADR != 0)){
        bWakeUp = USB_handleEnumCompleteEvent();
    }
    return (bWakeUp);
}




#endif

